app/Controllers/Api/Auth.php

    public function login()
    {
        // 1. รับค่า 'login' (ซึ่งอาจเป็น email หรือ username)
        $login_identity = $this->request->getVar('login');
        $password = $this->request->getVar('password');

        if (!$login_identity || !$password) {
            return $this->fail('กรุณาส่งข้อมูล Login และ Password', 400);
        }

        $userModel = new UserModel();

        // 2. ค้นหาทั้งสองคอลัมน์ (email หรือ username)
        $user = $userModel->where('email', $login_identity)
                          ->orWhere('username', $login_identity)
                          ->first();
---
SELECT *
FROM `ltc_users`
WHERE `email` = 'sso03'
OR `username` = 'sso03'
 LIMIT 1