app/Controllers/Admin.php

    public function dashboard()
    {
        $userAgent = $this->request->getUserAgent();
        $userData = $this->request->user;
        $userHcode = $userData->hcode;
        $officeData = $this->officeModel->find($userData->hcode);

        if($userAgent->isMobile()){

             $data = [
                'user' => $userData,
                'office' => $officeData,
             ];
             return view('mobile/menu',$data);
        } else {
             if($userData->role == 'auth')
            {
               $data = [
                    'population'  => $this->personModel->countAllResults(),
                    'riskNcds' => ceil($this->RiskdmModel->countAllResults() + $this->RiskhtModel->countAllResults()),
                    'newcase' => ceil($this->NewDMMOdel->countAllResults()+$this->NewHTModel->countAllResults()),
                    'inproj' => ceil($this->SeledmModel->countAllResults()),
                    'chronicAll' => ceil($this->OldDmModel->countAllResults()+$this->OldHtModel->countAllResults()),
                    'dmCkd' => $this->dmckdModel->countAllResults(),
                    'office'=> $officeData
                ];
---
SELECT *
FROM `office`
WHERE `office`.`hcode` = '00312'
SELECT COUNT(*) AS `numrows`
FROM `dmckd`
SELECT COUNT(*) AS `numrows`
FROM `person`
SELECT COUNT(*) AS `numrows`
FROM `olddm`
SELECT COUNT(*) AS `numrows`
FROM `oldht`

    public function office()
    {
        // 2. ดึงข้อมูลผู้ใช้ (Payload) ที่ Filter ถอดรหัสมาให้
        $userData = $this->request->user;

        // 3. ดึง hcode จาก Payload
        $userHcode = $userData->hcode;

        // 4. เตรียม Model และค้นหาข้อมูลหน่วยงาน
        $officeModel = new OfficeModel();

        // $officeModel->find($userHcode)
        // จะค้นหา Primary Key (hcode) ในตาราง ltc_office
        $officeData = $officeModel->find($userHcode);
---
SELECT *
FROM `office`
WHERE `office`.`hcode` = '00312'

    public function get_office()
    {
        $userData = $this->request->user;
        $userHcode = $userData->hcode;
        $OfficeModel = new OfficeModel();
         if($userData->role == 'auth')
            {
                $officeData = $OfficeModel->get()->getResultArray();
            } else {
                $officeData = $OfficeModel->where('hcode',$userHcode)->get()->getResultArray();
---
SELECT *
FROM `office`
WHERE `hcode` = '00312'