app/Controllers/HlController.php

    public function riskDm_HL()
    {
        $userData = $this->request->user;
        $officeData = $this->officeModel->find($userData->hcode);
        if($userData->role =='auth')
            {
                $userHcode = '';
                $seleoffice  =$this->officeModel->get()->getResultArray();
---
SELECT *
FROM `office`

    public function hl_page()
    {
        $userData = $this->request->user;
        $userHcode =  $userData->hcode;
        $officeData = $this->officeModel->find($userHcode);
        $hlcoach = $this->hcoachModel->get()->getResultArray();
        $osm = $this->osmModel->get()->getResultArray();
---
SELECT *
FROM `office`
WHERE `office`.`hcode` = '00312'
SELECT *
FROM `hcoach`
SELECT *
FROM `tb_osm`