app/Controllers/NewcaseController.php

SELECT *
FROM `office`
SELECT COUNT(*) AS `numrows`
FROM `newdm`
---
    public function newDm_page()
    {
        $userData = $this->request->user;
        $officeData = $this->officeModel->find($userData->hcode);
        $seleoffice  =$this->officeModel->get()->getResultArray();
        $newDM = $this->NewDMModel->countAllResults();