app/Models/OsmModel.php

    public function getperByhcodepid($where)
    {
        return $this->db
                    ->table($this->table)
                    ->where('cid',$where)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `tb_osm`
WHERE `cid` = '3340200006616'