app/Models/RiskhtModel.php

UPDATE `riskht` SET `inprojected` = 1
WHERE `id` = '276'
---
    public function updateData($id,$data)
    {
        return $this->db
                    ->table($this->table)
                    ->where('id',$id)
                    ->set($data)
                    ->update();

SELECT `riskht`.*, `riskht`.`id` as `rid`, CONCAT(person.fname, " ", person.lname) as pname, TIMESTAMPDIFF(YEAR, `person`.`birth`, CURDATE()) AS age, `person`.`typearea`, `village`.`villname`, `tumbon`.`tumbon`
FROM `riskht`
INNER JOIN `person` ON `riskht`.`hospcode`=`person`.`hospcode` and `riskht`.`pid`=`person`.`pid`
INNER JOIN `village` ON `riskht`.`vhid` = `village`.`villcode`
INNER JOIN `tumbon` ON left(riskht.vhid,6) = tumbon.tumid
WHERE `riskht`.`hospcode` = '03550'
---
    public function getRiskHtByhcode($hcode)
    {
        if(!empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('riskht.*,riskht.id as rid,CONCAT(person.fname," ",person.lname) as pname,TIMESTAMPDIFF(YEAR, person.birth, CURDATE()) AS age,person.typearea,village.villname,tumbon.tumbon')
                        ->join('person','riskht.hospcode=person.hospcode and riskht.pid=person.pid','inner')
                        ->join('village','riskht.vhid = village.villcode','inner')
                        ->join('tumbon','left(riskht.vhid,6) = tumbon.tumid','inner')
                        ->where('riskht.hospcode',$hcode)
                        ->get()
                        ->getResultArray();

SELECT `hospcode`, `office`.`hname` as `villname`, count(id) as countID
FROM `riskht`
JOIN `office` ON `riskht`.`hospcode`=`office`.`hcode`
GROUP BY `hospcode`
ORDER BY `countID` DESC
---
    public function getRiskByOrgan_chart($hcode = null)
    {
        if(!empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('vhid,village.villname,count(id) as countID')
                        ->join('village','riskht.vhid=village.villcode')
                        ->where('hospcode',$hcode)
                        ->groupBy('vhid,village.villname')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();
        } else {
            return $this->db
                        ->table($this->table)
                        ->select('hospcode,office.hname as villname,count(id) as countID')
                        ->join('office','riskht.hospcode=office.hcode')
                        ->groupBy('hospcode')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();