app/Models/RiskdmModel.php

    public function getRiskDmByhcode($hcode)
    {
        if(!empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('riskdm.*,riskdm.id as rid,CONCAT(person.fname," ",person.lname) as pname,TIMESTAMPDIFF(YEAR, person.birth, CURDATE()) AS age,person.sex,person.typearea,village.villname,tumbon.tumbon')
                        ->join('person','riskdm.hospcode=person.hospcode and riskdm.pid=person.pid','inner')
                        ->join('village','riskdm.vhid = village.villcode','inner')
                        ->join('tumbon','left(riskdm.vhid,6) = tumbon.tumid','inner')
                        ->where('riskdm.hospcode',$hcode)
                        ->get()
                        ->getResultArray();
        } else {
            return $this->db
                        ->table($this->table)
                        ->select('riskdm.*,riskdm.id as rid,CONCAT(person.fname," ",person.lname) as pname,TIMESTAMPDIFF(YEAR, person.birth, CURDATE()) AS age
                        ,person.sex,person.typearea,village.villname,tumbon.tumbon')
                        ->join('person','riskdm.hospcode=person.hospcode and riskdm.pid=person.pid','inner')
                        ->join('village','riskdm.vhid = village.villcode','inner')
                        ->join('tumbon','left(riskdm.vhid,6) = tumbon.tumid','inner')
                        ->get()
                        ->getResultArray();
---
SELECT `riskdm`.*, `riskdm`.`id` as `rid`, CONCAT(person.fname, " ", person.lname) as pname, TIMESTAMPDIFF(YEAR, `person`.`birth`, CURDATE()) AS age, `person`.`sex`, `person`.`typearea`, `village`.`villname`, `tumbon`.`tumbon`
FROM `riskdm`
INNER JOIN `person` ON `riskdm`.`hospcode`=`person`.`hospcode` and `riskdm`.`pid`=`person`.`pid`
INNER JOIN `village` ON `riskdm`.`vhid` = `village`.`villcode`
INNER JOIN `tumbon` ON left(riskdm.vhid,6) = tumbon.tumid

    public function getRiskByOrgan_chart($hcode = null)
    {
        if(!empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('vhid,village.villname,count(id) as countID')
                        ->join('village','riskdm.vhid=village.villcode')
                        ->where('hospcode',$hcode)
                        ->groupBy('vhid,village.villname')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();
        } else {
            return $this->db
                        ->table($this->table)
                        ->select('hospcode,office.hname as villname,count(id) as countID')
                        ->join('office','riskdm.hospcode=office.hcode')
                        ->groupBy('hospcode')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `vhid`, `village`.`villname`, count(id) as countID
FROM `riskdm`
JOIN `village` ON `riskdm`.`vhid`=`village`.`villcode`
WHERE `hospcode` = '00312'
GROUP BY `vhid`, `village`.`villname`
SELECT `hospcode`, `office`.`hname` as `villname`, count(id) as countID
FROM `riskdm`
JOIN `office` ON `riskdm`.`hospcode`=`office`.`hcode`
GROUP BY `hospcode`
ORDER BY `countID` DESC

    public function getRiskAll($hcode)
    {
        if(!Empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('result,count(id) as countID')
                        ->where('hospcode',$hcode)
                        ->groupBy('result')
                        ->get()
                        ->getResultArray();
        } else {
            return $this->db
                        ->table($this->table)
                        ->select('result,count(id) as countID')
                        ->groupBy('result')
                        ->get()
                        ->getResultArray();
---
SELECT `result`, count(id) as countID
FROM `riskdm`
WHERE `hospcode` = '03553'
GROUP BY `result`
SELECT `result`, count(id) as countID
FROM `riskdm`
GROUP BY `result`