app/Models/SeleHtModel.php

    public function getRiskByOrgan_chart($hcode = null)
    {
        if(!empty($hcode)){
            return $this->db
                        ->table($this->table)
                        ->select('vhid,village.villname,count(id) as countID')
                        ->join('village','selected_riskht.vhid=village.villcode')
                        ->where('hospcode',$hcode)
                        ->groupBy('vhid,village.villname')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();
        } else {
            return $this->db
                        ->table($this->table)
                        ->select('hospcode,office.hname as villname,count(id) as countID')
                        ->join('office','selected_riskht.hospcode=office.hcode')
                        ->groupBy('hospcode,villname')
                        ->orderBy('countID','DESC')
                        ->get()
                        ->getResultArray();
---
SELECT `vhid`, `village`.`villname`, count(id) as countID
FROM `selected_riskht`
JOIN `village` ON `selected_riskht`.`vhid`=`village`.`villcode`
WHERE `hospcode` = '03553'
GROUP BY `vhid`, `village`.`villname`
ORDER BY `countID` DESC
SELECT `hospcode`, `office`.`hname` as `villname`, count(id) as countID
FROM `selected_riskht`
JOIN `office` ON `selected_riskht`.`hospcode`=`office`.`hcode`
GROUP BY `hospcode`, `villname`
ORDER BY `countID` DESC